app/views/shared/_search.html.slim

        .col-md-4
          = f.select :name_in,
            options_from_collection_for_select(current_user.items, :name,
            proc { |obj| obj.name },
            selected: params[:q] ? params[:q][:name_in] : nil),
            { include_blank: 'Select' }, { class: 'chosen-select form-control' }
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]