app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
  def find_item
    @item = current_user.items.find(params[:id])