app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
  def index
    @search = current_user.orders.ransack(params[:q])

SELECT  "items".* FROM "items" ORDER BY "items"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def new
    @item = Item.first